JamesBara/HAL-files/Src/stm32l452_hal_clock.c
/**************************************************************************************
 *  How to use:
 *  
 *  The user should first select the oscillators that they want to enable by
 *  calling the functions:
 *  clock_enable_hsi(); ///<Enable hsi oscillator.
 *  clock_conf_msi(uint32_t msi_freq); ///<Enable msi oscillator or change frequency.
 *  clock_conf_hse(uint32_t hse_freq, hse_clk_by hse_by); ///<Enable hse oscillator. 
 *   
 *  If the user wants to enable the pll they need to call the function 
 *  void clock_pll_conf(pll_clk_src clk_src,uint32_t sysclk_freq,
 *  uint32_t pll48m1clk_freq,uint32_t pllp_freq);
 *  @todo Implement pllsai1 in the above function. Add Vcore range 2.
 *  After activating the oscillators and/or the pll, in order to set the system clock
 *  (HCLK) the user should call the function:
 *  void clock_hclk_conf(sys_clk_src clk_src, hse_css css_enable, uint32_t target_freq); 
 *  @todo Add Vcore range 2.
 *  @note All of the functions are taking in account only Vcore range 1 frequencies, and
 *  may or may not work properly with Vcore range 2.
 * 
 ***************************************************************************************/
#include "stm32l452_hal_clock.h"

static uint32_t clock_get_msi_freq();
static uint32_t clock_get_pll_src_freq();

/**
 * @brief Get the current msi oscillator frequency.
 * 
 * @return uint32_t The msi oscillator frequency in Hz.
 */
static uint32_t clock_get_msi_freq()
{
    if (!(RCC->CR & RCC_CR_MSIRGSEL))
    {
        return MSIRangeTable[((RCC->CSR & RCC_CSR_MSISRANGE)>>RCC_CSR_MSISRANGE_Pos)];
    }
    else
    {
        return MSIRangeTable[((RCC->CR & RCC_CR_MSIRANGE)>>RCC_CR_MSIRANGE_Pos)];
    }
}

/**
 * @brief Get the current pll source oscillator frequency.
 * 
 * @return uint32_t The pll source oscillator frequency in Hz.
 */
static uint32_t clock_get_pll_src_freq()
{
    uint32_t src_freq = 0;
    if ((RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC)==RCC_PLLCFGR_PLLSRC_HSI)
    {
        src_freq = 16000000;
    }
    else if((RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC)==RCC_PLLCFGR_PLLSRC_MSI)
    {
        src_freq = clock_get_msi_freq();
    }
    else if((RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC)==RCC_PLLCFGR_PLLSRC_HSE)
    {
        src_freq = hse_frequency;
    }
    else
    {
        //Shouldn't be here
        error_handler(__FILE__,__LINE__);
    }
        return src_freq;
}

/**
 * @brief Get the HCLK clock frequency.
 * 
 * @return uint32_t The NVIC SystemCoreClock frequency in Hz.
 */
uint32_t clock_get_hclk_freq()
{
    return SystemCoreClock;
}

/**
 * @brief Get the SYSCLK clock frequency.
 * 
 * @return uint32_t The SYSCLK clock frequency in Hz.
 */
uint32_t clock_get_sysclk_freq()
{
    //If the selected system clock is hsi return hsi value.
    if ((RCC->CFGR & RCC_CFGR_SWS)==RCC_CFGR_SWS_HSI)
    {
        return 16000000;
    }
    //If the selected system clock is msi find the msi value from the appropriate register and return it.
    else if ((RCC->CFGR & RCC_CFGR_SWS)==RCC_CFGR_SWS_MSI)
    {
        return clock_get_msi_freq();
    }
    //If the selected system clock is hse return the user defined value of hse.
    else if ((RCC->CFGR & RCC_CFGR_SWS)==RCC_CFGR_SWS_HSE)
    {
        return hse_frequency;
    }

    //If the selected system clock is pll find the source of the pll from registers, and calculate the system value.
    else if ((RCC->CFGR & RCC_CFGR_SWS)==RCC_CFGR_SWS_PLL)
    {
        uint32_t pllm = ((RCC->PLLCFGR & RCC_PLLCFGR_PLLM)>>RCC_PLLCFGR_PLLM_Pos);
        uint32_t plln = ((RCC->PLLCFGR & RCC_PLLCFGR_PLLN)>>RCC_PLLCFGR_PLLN_Pos);
        uint32_t pllr = ((RCC->PLLCFGR & RCC_PLLCFGR_PLLR)>>RCC_PLLCFGR_PLLR_Pos);

        return ((clock_get_pll_src_freq()/pllm)*plln)/pllr;
    }
    else
    {
        //Shouldn't be here
        return 0;
    }
}

/**
 * @brief Enable The hsi oscillator.
 * 
 */
void clock_enable_hsi()
{
    sys_set_systick();

    //If HSI is off turn it on.
    if (!(RCC->CR & RCC_CR_HSION))
    {
        //Turn on HSI.
        RCC->CR |= RCC_CR_HSION;
        uint32_t start = sys_get_systick();
        //Wait for hsi to start. If it fails to start within 2 secs go to error.
        while (!(RCC->CR & RCC_CR_HSIRDY))
        {
            if (sys_get_systick()-start>2)
            {
                error_handler(__FILE__,__LINE__);
            }
        }
             
    }
}

/**
 * @brief Enable the msi oscillator or change the frequency.
 * 
 * @note if an invalid parameter is entered the default clock of 4Mhz is selected.
 * @param msi_freq This parameter sets the msi oscillator frequency in Hz. 
 */
void clock_conf_msi(uint32_t msi_freq)
{
    uint8_t msi_freq_range = 6;
    sys_set_systick();
    uint32_t start;
    switch (msi_freq)
    {
        case 100000:
            msi_freq_range = 0;
        break;
        case 200000:
            msi_freq_range = 1;
        break;
        case 400000:
            msi_freq_range = 2;
        break;        
        case 800000:
            msi_freq_range = 3;
        break;        
        case 1000000:
            msi_freq_range = 4;
        break;        
        case 2000000:
            msi_freq_range = 5;
        break;        
        case 8000000:
            msi_freq_range = 7;
        break;        
        case 16000000:
            msi_freq_range = 8;
        break;
        case 24000000:
            msi_freq_range = 9;
        break;
        case 32000000:
            msi_freq_range = 10;
        break;
        case 48000000:
            msi_freq_range = 11;
        break;
        default:
            msi_freq_range = 6;
        break;
    }

    //If msi clock is on, turn it off and change it's range. (Test it first we may not need to turn it off,only test if it's ready.)
    if (RCC->CR & RCC_CR_MSION)
    {
        RCC->CR &= ~(RCC_CR_MSION);        
        start = sys_get_systick();
        while (!(RCC->CR & RCC_CR_MSIRDY))
        {
            if (sys_get_systick()-start>2)
            {
                error_handler(__FILE__,__LINE__);
            }
        }
    }
    //Set  msirgsel
    RCC->CR |= RCC_CR_MSIRGSEL;
    //Set clock
    RCC->CR &= ~(RCC_CR_MSIRANGE);
    RCC->CR |= msi_freq_range<<RCC_CR_MSIRANGE_Pos;
    //Turn on MSI.
    RCC->CR |= RCC_CR_MSION;
    start = sys_get_systick();
    while (!(RCC->CR & RCC_CR_MSIRDY))
    {
        if (sys_get_systick()-start>2)
        {
            error_handler(__FILE__,__LINE__);
        }
    }
    //If HCLK is set to msi, update SystemCoreClock.
    if (((RCC->CFGR & RCC_CFGR_SWS)>>RCC_CFGR_SWS_Pos)==RCC_CFGR_SWS_MSI)
    {
        SystemCoreClock = clock_get_msi_freq();
    }

