JamesBara/HAL-files/Src/stm32l452_hal_clock.c
    }
    else if (clk_src == SYSCLK_SRC_HSE)
    {
        if (RCC->CR & RCC_CR_HSEON)
        {
            src_freq = hse_frequency;
        }
    }
    else if (clk_src == SYSCLK_SRC_PLL)
    {
        if ((RCC->CR & RCC_CR_PLLON) && (RCC->PLLCFGR & RCC_PLLCFGR_PLLREN))
        {
            uint32_t pllm = ((RCC->PLLCFGR & RCC_PLLCFGR_PLLM)>>RCC_PLLCFGR_PLLM_Pos);
            uint32_t plln = ((RCC->PLLCFGR & RCC_PLLCFGR_PLLN)>>RCC_PLLCFGR_PLLN_Pos);
            uint32_t pllr = ((RCC->PLLCFGR & RCC_PLLCFGR_PLLR)>>RCC_PLLCFGR_PLLR_Pos);
            src_freq = ((clock_get_pll_src_freq()/(pllm+1))*plln)/(2*(1+pllr));
        }
    }
    //Calculate the prescaler value
    for (uint32_t i=0;i<=8;i++)
    {
        if (src_freq/ahb_presc[i]<=80000000 && src_freq/ahb_presc[i]==target_freq)
        {
            if (!i)
            {
                ahb_presc_val = i;
            }
            else
            {
                ahb_presc_val = 0x8 | (i-1);
            }
            break;
        }
    }
    //Calculate current hclk
    if (!((RCC->CFGR & RCC_CFGR_HPRE>>RCC_CFGR_HPRE_Pos)>>3))
    {
        current_hclk_freq = clock_get_sysclk_freq();
    }
    else
    {
        current_hclk_freq = clock_get_sysclk_freq()/ahb_presc[(((RCC->CFGR & RCC_CFGR_HPRE>>RCC_CFGR_HPRE_Pos)&(~0x08))+1)];
    }
    //We have everything we need. Time to set the registers.
    //Set css
    if (src_freq && ((clk_src == SYSCLK_SRC_HSE) || ((clk_src == SYSCLK_SRC_PLL) && ((RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC)==RCC_PLLCFGR_PLLSRC_HSE))))
    {
        RCC->CR |= css_enable<<RCC_CR_CSSON_Pos;
    }
    //Decreasing frequency
    if (current_hclk_freq>target_freq && src_freq)
    {
        //Set the source clock
        RCC->CFGR &= ~(RCC_CFGR_SW);
        RCC->CFGR |= clk_src<<RCC_CFGR_SW_Pos;

        //Set the prescaler value
        RCC->CFGR &= ~(RCC_CFGR_HPRE);
        RCC->CFGR |= ahb_presc_val<<RCC_CFGR_HPRE_Pos;
        //Enable prefetch
        FLASH->ACR &= ~(FLASH_ACR_PRFTEN);
        FLASH->ACR |= ~(FLASH_ACR_PRFTEN);

        //Set wait states
        uint32_t ws = target_freq/16000000;
        //Reduce the wait state to the correct one.  
        if (target_freq == 16000000 || target_freq==32000000 || target_freq==48000000 || target_freq==64000000 || target_freq==80000000)
        {
            ws--;
        }
   
        FLASH->ACR &= ~(FLASH_ACR_LATENCY);
        FLASH->ACR |= (ws)<<FLASH_ACR_LATENCY_Pos;
    }
    //Increasing frequency
    else if(current_hclk_freq<target_freq && src_freq)
    {
        //Enable prefetch
        FLASH->ACR &= ~(FLASH_ACR_PRFTEN);
        FLASH->ACR |= ~(FLASH_ACR_PRFTEN);

        //Set wait states
        uint32_t ws = target_freq/16000000;
        //Reduce the wait state to the correct one.
        if (target_freq == 16000000 || target_freq==32000000 || target_freq==48000000 || target_freq==64000000 || target_freq==80000000)
        {
            ws--;
        }

        FLASH->ACR &= ~(FLASH_ACR_LATENCY);
        FLASH->ACR |= ws<<FLASH_ACR_LATENCY_Pos;

        //Set the source clock
        RCC->CFGR &= ~(RCC_CFGR_SW);
        RCC->CFGR |= clk_src<<RCC_CFGR_SW_Pos;

        //Set the prescaler value
        RCC->CFGR &= ~(RCC_CFGR_HPRE);
        RCC->CFGR |= ahb_presc_val<<RCC_CFGR_HPRE_Pos;
    }
    //Make sure the clock is properly set. Then use it to set the NVIC clock.
    if (!(ahb_presc_val>>0x03))
    {
        if (src_freq == target_freq)
        {
            //Set NVIC clock.
            SystemCoreClock = target_freq;
            //initialize ticks.
            sys_set_systick();
        }
    }
    else
    {
        if (src_freq/ahb_presc[((ahb_presc_val+1)&0x07)] == target_freq)
        {
            //Set NVIC clock.
            SystemCoreClock = target_freq;
            //initialize ticks.
            sys_set_systick();
        }
    }

}

/**
 * @brief Enable or change the peripheral clock frequency.
 * 
 * @note Peripheral prescaler value is calculated automatically, if the target frequency is
 *       incorrect a prescaler value of 0 (peripheral frequency = HCLK) is selected.
 * 
 * @param apb_per This parameter allows the choice between APB1 or ABP2 peripheral clock 
 *                and can be any of the values:
 * 	              APB_SEL_1 = 0x01,
 *	              APB_SEL_2 = 0x02
 * @param target_freq This parameter can be equal to HCLK or HCLK devided by the prescaler.
 */
void clock_periph_conf(apb_per_sel apb_per, uint32_t target_freq)
{
    uint32_t apb_presc = 0;
    for (uint32_t i=0;i<=3;i++)
    {
        if (SystemCoreClock/(1<<(i+1)) == target_freq)
        {
            apb_presc = 0x04 | i;
            break;
        }
    }

    if(apb_per==APB_SEL_1)
    {
            //Set prescaler.
            RCC->CFGR &= ~(RCC_CFGR_PPRE1);
            RCC->CFGR |= apb_presc<<RCC_CFGR_PPRE1_Pos;
    }
    else
    {
        //Set prescaler.
        RCC->CFGR &= ~(RCC_CFGR_PPRE2);
        RCC->CFGR |= apb_presc<<RCC_CFGR_PPRE2_Pos;
    }
}

/**
 * @brief Get the frequency of a peripheral.
 * 
 * @param apb_per This parameter allows the choice between APB1 or ABP2 peripheral clock 
 *                and can be any of the values:
 * 	              APB_SEL_1 = 0x01,
 *	              APB_SEL_2 = 0x02
 * @return uint32_t Frequency in Hz.
 */
uint32_t clock_get_periph_freq(apb_per_sel apb_per)
{
    uint32_t apb_presc = 0;

    //Get the prescaler value for the selected peripheral.
    if(apb_per==APB_SEL_1)
    {
        apb_presc = ((RCC->CFGR & RCC_CFGR_PPRE1)>>RCC_CFGR_PPRE1_Pos);
    }
    else
    {
        apb_presc = ((RCC->CFGR & RCC_CFGR_PPRE2)>>RCC_CFGR_PPRE2_Pos);
    }
    
    if (!(apb_presc & 0x04))
    {
        return SystemCoreClock;
    }
    else
    {
        return SystemCoreClock/(1<<((apb_presc & 0x03)+1));
    }

}